Ran Plan for 40 projects:

1. dir: `infra/aws/global/iam/roles/atlantis` workspace: `default`
1. dir: `infra/aws/global/iam/roles/crossplane` workspace: `default`
1. dir: `infra/aws/global/route53/records/marlowe-finance.io` workspace: `default`
1. dir: `infra/aws/global/route53/records/marlowe.iohk.io` workspace: `default`
1. dir: `infra/aws/global/route53/records/us-east-2.vpce.grafana.net` workspace: `default`
1. dir: `infra/aws/global/route53/zones` workspace: `default`
1. dir: `infra/aws/prod-us-east-1/vpc` workspace: `default`
1. dir: `infra/aws` workspace: `default`
1. dir: `infra` workspace: `default`
1. dir: `infra/aws/us-east-1/dev/eks/cluster-addons` workspace: `default`
1. dir: `infra/aws/us-east-1/dev/eks/cluster` workspace: `default`
1. dir: `infra/aws/us-east-1/dev/eks/honeycomb` workspace: `default`
1. dir: `infra/aws/us-east-1/dev/eks/kubevela-addons` workspace: `default`
1. dir: `infra/aws/us-east-1/dev/rds/security-group` workspace: `default`
1. dir: `infra/aws/us-east-1/dev/rds/subnet-group` workspace: `default`
1. dir: `infra/aws/us-east-1/dev/vpc` workspace: `default`
1. dir: `infra/aws/us-east-1/mgmt/ecr` workspace: `default`
1. dir: `infra/aws/us-east-1/mgmt/peering/dev` workspace: `default`
1. dir: `infra/aws/us-east-1/mgmt/peering/prod` workspace: `default`
1. dir: `infra/aws/us-east-1/mgmt/vpc` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/eks/green/application-secrets` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/eks/green/eks-addons` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/eks/green/eks` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/eks/green/grafana-agent` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/eks/green/kubevela-addons` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/kms` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/peering/dapps-old` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/peering/grafana` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/rds/bastion/ec2-instance` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/rds/bastion/key-pair` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/rds/bastion/security-group` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/rds/looker-studio-db` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/rds/prod-marlowe-runtime-db` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/rds/security-group-jingles` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/rds/security-group` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/rds/subnet-group` workspace: `default`
1. dir: `infra/aws/us-east-1/prod/vpc` workspace: `default`
1. dir: `infra/aws/us-east-2/prod/grafana/private-link` workspace: `default`
1. dir: `infra/aws/us-east-2/prod/grafana/vpc` workspace: `default`

### 1. dir: `infra/aws/global/iam/roles/atlantis` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/aws/global/iam/roles/atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Faws%252Fglobal%252Fiam%252Froles%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/aws/global/iam/roles/atlantis`

---
### 2. dir: `infra/aws/global/iam/roles/crossplane` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/aws/global/iam/roles/crossplane`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Faws%252Fglobal%252Fiam%252Froles%252Fcrossplane%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/aws/global/iam/roles/crossplane`

---
### 3. dir: `infra/aws/global/route53/records/marlowe-finance.io` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/aws/global/route53/records/marlowe-finance.io`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Faws%252Fglobal%252Froute53%252Frecords%252Fmarlowe-finance.io%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/aws/global/route53/records/marlowe-finance.io`

---
### 4. dir: `infra/aws/global/route53/records/marlowe.iohk.io` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/aws/global/route53/records/marlowe.iohk.io`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Faws%252Fglobal%252Froute53%252Frecords%252Fmarlowe.iohk.io%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/aws/global/route53/records/marlowe.iohk.io`

---
### 5. dir: `infra/aws/global/route53/records/us-east-2.vpce.grafana.net` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/aws/global/route53/records/us-east-2.vpce.grafana.net`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Faws%252Fglobal%252Froute53%252Frecords%252Fus-east-2.vpce.grafana.net%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/aws/global/route53/records/us-east-2.vpce.grafana.net`

---
### 6. dir: `infra/aws/global/route53/zones` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/aws/global/route53/zones`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Faws%252Fglobal%252Froute53%252Fzones%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/aws/global/route53/zones`

---
### 7. dir: `infra/aws/prod-us-east-1/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_eip.nat[0] will be updated in-place
!   resource "aws_eip" "nat" {
        id                   = "eipalloc-0f99c6d0cebe114f3"
!       tags                 = {
            "Environment" = "prod"
!           "Name"        = "dapps-prod-us-east-1-us-east-1a" -> "scde-prod-us-east-1-us-east-1a"
!           "Project"     = "dapps" -> "scde"
            "Terraform"   = "true"
        }
!       tags_all             = {
!           "Name"         = "dapps-prod-us-east-1-us-east-1a" -> "scde-prod-us-east-1-us-east-1a"
+           "Organization" = "iog"
!           "Project"      = "dapps" -> "scde"
+           "Tribe"        = "smartcontracts"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_internet_gateway.this[0] will be updated in-place
!   resource "aws_internet_gateway" "this" {
        id       = "igw-08ecf3a4b63c2156a"
!       tags     = {
            "Environment" = "prod"
!           "Name"        = "dapps-prod-us-east-1" -> "scde-prod-us-east-1"
!           "Project"     = "dapps" -> "scde"
            "Terraform"   = "true"
        }
!       tags_all = {
!           "Name"         = "dapps-prod-us-east-1" -> "scde-prod-us-east-1"
+           "Organization" = "iog"
!           "Project"      = "dapps" -> "scde"
+           "Tribe"        = "smartcontracts"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_nat_gateway.this[0] will be updated in-place
!   resource "aws_nat_gateway" "this" {
        id                                 = "nat-02bd837095d8032db"
!       tags                               = {
            "Environment" = "prod"
!           "Name"        = "dapps-prod-us-east-1-us-east-1a" -> "scde-prod-us-east-1-us-east-1a"
!           "Project"     = "dapps" -> "scde"
            "Terraform"   = "true"
        }
!       tags_all                           = {
!           "Name"         = "dapps-prod-us-east-1-us-east-1a" -> "scde-prod-us-east-1-us-east-1a"
+           "Organization" = "iog"
!           "Project"      = "dapps" -> "scde"
+           "Tribe"        = "smartcontracts"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_route_table.intra[0] will be updated in-place
!   resource "aws_route_table" "intra" {
        id               = "rtb-0ec35452bcdd9097b"
!       tags             = {
            "Environment" = "prod"
!           "Name"        = "dapps-prod-us-east-1-intra" -> "scde-prod-us-east-1-intra"
!           "Project"     = "dapps" -> "scde"
            "Terraform"   = "true"
        }
!       tags_all         = {
!           "Name"         = "dapps-prod-us-east-1-intra" -> "scde-prod-us-east-1-intra"
+           "Organization" = "iog"
!           "Project"      = "dapps" -> "scde"
+           "Tribe"        = "smartcontracts"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_route_table.private[0] will be updated in-place
!   resource "aws_route_table" "private" {
        id               = "rtb-016ca43d91bc6be72"
!       tags             = {
            "Environment" = "prod"
!           "Name"        = "dapps-prod-us-east-1-private" -> "scde-prod-us-east-1-private"
!           "Project"     = "dapps" -> "scde"
            "Terraform"   = "true"
        }
!       tags_all         = {
!           "Name"         = "dapps-prod-us-east-1-private" -> "scde-prod-us-east-1-private"
+           "Organization" = "iog"
!           "Project"      = "dapps" -> "scde"
+           "Tribe"        = "smartcontracts"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_route_table.public[0] will be updated in-place
!   resource "aws_route_table" "public" {
        id               = "rtb-087eb36190f7591da"
!       tags             = {
            "Environment" = "prod"
!           "Name"        = "dapps-prod-us-east-1-public" -> "scde-prod-us-east-1-public"
!           "Project"     = "dapps" -> "scde"
            "Terraform"   = "true"
        }
!       tags_all         = {
!           "Name"         = "dapps-prod-us-east-1-public" -> "scde-prod-us-east-1-public"
+           "Organization" = "iog"
!           "Project"      = "dapps" -> "scde"
+           "Tribe"        = "smartcontracts"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_subnet.intra[0] will be updated in-place
!   resource "aws_subnet" "intra" {
        id                                             = "subnet-0e91f670ebcec49f6"
!       tags                                           = {
            "Environment" = "prod"
!           "Name"        = "dapps-prod-us-east-1-intra-us-east-1a" -> "scde-prod-us-east-1-intra-us-east-1a"
!           "Project"     = "dapps" -> "scde"
            "Terraform"   = "true"
        }
!       tags_all                                       = {
!           "Name"         = "dapps-prod-us-east-1-intra-us-east-1a" -> "scde-prod-us-east-1-intra-us-east-1a"
+           "Organization" = "iog"
!           "Project"      = "dapps" -> "scde"
+           "Tribe"        = "smartcontracts"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.intra[1] will be updated in-place
!   resource "aws_subnet" "intra" {
        id                                             = "subnet-0c4ad56e2b8e56c99"
!       tags                                           = {
            "Environment" = "prod"
!           "Name"        = "dapps-prod-us-east-1-intra-us-east-1b" -> "scde-prod-us-east-1-intra-us-east-1b"
!           "Project"     = "dapps" -> "scde"
            "Terraform"   = "true"
        }
!       tags_all                                       = {
!           "Name"         = "dapps-prod-us-east-1-intra-us-east-1b" -> "scde-prod-us-east-1-intra-us-east-1b"
+           "Organization" = "iog"
!           "Project"      = "dapps" -> "scde"
+           "Tribe"        = "smartcontracts"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.intra[2] will be updated in-place
!   resource "aws_subnet" "intra" {
        id                                             = "subnet-05c48f6231abb70ab"
!       tags                                           = {
            "Environment" = "prod"
!           "Name"        = "dapps-prod-us-east-1-intra-us-east-1c" -> "scde-prod-us-east-1-intra-us-east-1c"
!           "Project"     = "dapps" -> "scde"
            "Terraform"   = "true"
        }
!       tags_all                                       = {
!           "Name"         = "dapps-prod-us-east-1-intra-us-east-1c" -> "scde-prod-us-east-1-intra-us-east-1c"
+           "Organization" = "iog"
!           "Project"      = "dapps" -> "scde"
+           "Tribe"        = "smartcontracts"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.private[0] will be updated in-place
!   resource "aws_subnet" "private" {
        id                                             = "subnet-0b59f448253418ccc"
!       tags                                           = {
            "Environment"                                = "prod"
!           "Name"                                       = "dapps-prod-us-east-1-private-us-east-1a" -> "scde-prod-us-east-1-private-us-east-1a"
!           "Project"                                    = "dapps" -> "scde"
            "Terraform"                                  = "true"
-           "kubernetes.io/cluster/dapps-prod-us-east-1" = "shared" -> null
+           "kubernetes.io/cluster/scde-prod-us-east-1"  = "shared"
            "kubernetes.io/role/internal-elb"            = "1"
        }
!       tags_all                                       = {
!           "Name"                                       = "dapps-prod-us-east-1-private-us-east-1a" -> "scde-prod-us-east-1-private-us-east-1a"
+           "Organization"                               = "iog"
!           "Project"                                    = "dapps" -> "scde"
+           "Tribe"                                      = "smartcontracts"
-           "kubernetes.io/cluster/dapps-prod-us-east-1" = "shared" -> null
+           "kubernetes.io/cluster/scde-prod-us-east-1"  = "shared"
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.private[1] will be updated in-place
!   resource "aws_subnet" "private" {
        id                                             = "subnet-0329aca4a61551366"
!       tags                                           = {
            "Environment"                                = "prod"
!           "Name"                                       = "dapps-prod-us-east-1-private-us-east-1b" -> "scde-prod-us-east-1-private-us-east-1b"
!           "Project"                                    = "dapps" -> "scde"
            "Terraform"                                  = "true"
-           "kubernetes.io/cluster/dapps-prod-us-east-1" = "shared" -> null
+           "kubernetes.io/cluster/scde-prod-us-east-1"  = "shared"
            "kubernetes.io/role/internal-elb"            = "1"
        }
!       tags_all                                       = {
!           "Name"                                       = "dapps-prod-us-east-1-private-us-east-1b" -> "scde-prod-us-east-1-private-us-east-1b"
+           "Organization"                               = "iog"
!           "Project"                                    = "dapps" -> "scde"
+           "Tribe"                                      = "smartcontracts"
-           "kubernetes.io/cluster/dapps-prod-us-east-1" = "shared" -> null
+           "kubernetes.io/cluster/scde-prod-us-east-1"  = "shared"
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.private[2] will be updated in-place
!   resource "aws_subnet" "private" {
        id                                             = "subnet-0608937a0f6a1f0d4"
!       tags                                           = {
            "Environment"                                = "prod"
!           "Name"                                       = "dapps-prod-us-east-1-private-us-east-1c" -> "scde-prod-us-east-1-private-us-east-1c"
!           "Project"                                    = "dapps" -> "scde"
            "Terraform"                                  = "true"
-           "kubernetes.io/cluster/dapps-prod-us-east-1" = "shared" -> null
+           "kubernetes.io/cluster/scde-prod-us-east-1"  = "shared"
            "kubernetes.io/role/internal-elb"            = "1"
        }
!       tags_all                                       = {
!           "Name"                                       = "dapps-prod-us-east-1-private-us-east-1c" -> "scde-prod-us-east-1-private-us-east-1c"
+           "Organization"                               = "iog"
!           "Project"                                    = "dapps" -> "scde"
+           "Tribe"                                      = "smartcontracts"
-           "kubernetes.io/cluster/dapps-prod-us-east-1" = "shared" -> null
+           "kubernetes.io/cluster/scde-prod-us-east-1"  = "shared"
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.public[0] will be updated in-place
!   resource "aws_subnet" "public" {
        id                                             = "subnet-087617570cd189b3e"
!       tags                                           = {
            "Environment"                                = "prod"
!           "Name"                                       = "dapps-prod-us-east-1-public-us-east-1a" -> "scde-prod-us-east-1-public-us-east-1a"
!           "Project"                                    = "dapps" -> "scde"
            "Terraform"                                  = "true"
-           "kubernetes.io/cluster/dapps-prod-us-east-1" = "shared" -> null
+           "kubernetes.io/cluster/scde-prod-us-east-1"  = "shared"
            "kubernetes.io/role/elb"                     = "1"
        }
!       tags_all                                       = {
!           "Name"                                       = "dapps-prod-us-east-1-public-us-east-1a" -> "scde-prod-us-east-1-public-us-east-1a"
+           "Organization"                               = "iog"
!           "Project"                                    = "dapps" -> "scde"
+           "Tribe"                                      = "smartcontracts"
-           "kubernetes.io/cluster/dapps-prod-us-east-1" = "shared" -> null
+           "kubernetes.io/cluster/scde-prod-us-east-1"  = "shared"
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.public[1] will be updated in-place
!   resource "aws_subnet" "public" {
        id                                             = "subnet-00f1682efee7daae2"
!       tags                                           = {
            "Environment"                                = "prod"
!           "Name"                                       = "dapps-prod-us-east-1-public-us-east-1b" -> "scde-prod-us-east-1-public-us-east-1b"
!           "Project"                                    = "dapps" -> "scde"
            "Terraform"                                  = "true"
-           "kubernetes.io/cluster/dapps-prod-us-east-1" = "shared" -> null
+           "kubernetes.io/cluster/scde-prod-us-east-1"  = "shared"
            "kubernetes.io/role/elb"                     = "1"
        }
!       tags_all                                       = {
!           "Name"                                       = "dapps-prod-us-east-1-public-us-east-1b" -> "scde-prod-us-east-1-public-us-east-1b"
+           "Organization"                               = "iog"
!           "Project"                                    = "dapps" -> "scde"
+           "Tribe"                                      = "smartcontracts"
-           "kubernetes.io/cluster/dapps-prod-us-east-1" = "shared" -> null
+           "kubernetes.io/cluster/scde-prod-us-east-1"  = "shared"
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.public[2] will be updated in-place
!   resource "aws_subnet" "public" {
        id                                             = "subnet-08be8ad5350e1313a"
!       tags                                           = {
            "Environment"                                = "prod"
!           "Name"                                       = "dapps-prod-us-east-1-public-us-east-1c" -> "scde-prod-us-east-1-public-us-east-1c"
!           "Project"                                    = "dapps" -> "scde"
            "Terraform"                                  = "true"
-           "kubernetes.io/cluster/dapps-prod-us-east-1" = "shared" -> null
+           "kubernetes.io/cluster/scde-prod-us-east-1"  = "shared"
            "kubernetes.io/role/elb"                     = "1"
        }
!       tags_all                                       = {
!           "Name"                                       = "dapps-prod-us-east-1-public-us-east-1c" -> "scde-prod-us-east-1-public-us-east-1c"
+           "Organization"                               = "iog"
!           "Project"                                    = "dapps" -> "scde"
+           "Tribe"                                      = "smartcontracts"
-           "kubernetes.io/cluster/dapps-prod-us-east-1" = "shared" -> null
+           "kubernetes.io/cluster/scde-prod-us-east-1"  = "shared"
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # aws_vpc.this[0] will be updated in-place
!   resource "aws_vpc" "this" {
        id                                   = "vpc-0a68a5d196ce5e1d1"
!       tags                                 = {
            "Environment" = "prod"
!           "Name"        = "dapps-prod-us-east-1" -> "scde-prod-us-east-1"
!           "Project"     = "dapps" -> "scde"
            "Terraform"   = "true"
        }
!       tags_all                             = {
!           "Name"         = "dapps-prod-us-east-1" -> "scde-prod-us-east-1"
+           "Organization" = "iog"
!           "Project"      = "dapps" -> "scde"
+           "Tribe"        = "smartcontracts"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

Plan: 0 to add, 16 to change, 0 to destroy.

Changes to Outputs:
!   name                                        = "dapps-prod-us-east-1" -> "scde-prod-us-east-1"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/aws/prod-us-east-1/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Faws%252Fprod-us-east-1%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/aws/prod-us-east-1/vpc`
</details>
Plan: 0 to add, 16 to change, 0 to destroy.

---
### 8. dir: `infra/aws` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws": 
time=2024-01-15T18:46:00Z level=error msg=Error: Error in function call


time=2024-01-15T18:46:00Z level=error msg=  on /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/terragrunt.hcl line 39, in locals:

time=2024-01-15T18:46:00Z level=error msg=  39:   environment_vars = read_terragrunt_config(find_in_parent_folders("env.hcl"))

time=2024-01-15T18:46:00Z level=error msg=

time=2024-01-15T18:46:00Z level=error msg=Call to function "find_in_parent_folders" failed: ParentFileNotFound: Could not
find a env.hcl in any of the parent folders of
/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/terragrunt.hcl.
Cause: Traversed all the way to the root..


time=2024-01-15T18:46:00Z level=error msg=Encountered error while evaluating locals in file /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/terragrunt.hcl
time=2024-01-15T18:46:00Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/terragrunt.hcl:39,45-68: Error in function call; Call to function "find_in_parent_folders" failed: ParentFileNotFound: Could not find a env.hcl in any of the parent folders of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/terragrunt.hcl. Cause: Traversed all the way to the root..
time=2024-01-15T18:46:00Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```
</details>

---
### 9. dir: `infra` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra": 
time=2024-01-15T18:46:01Z level=error msg=Error reading file at path /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/terragrunt.hcl: open /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/terragrunt.hcl: no such file or directory
time=2024-01-15T18:46:01Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 10. dir: `infra/aws/us-east-1/dev/eks/cluster-addons` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/aws/us-east-1/dev/eks/cluster-addons`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Faws%252Fus-east-1%252Fdev%252Feks%252Fcluster-addons%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/aws/us-east-1/dev/eks/cluster-addons`

---
### 11. dir: `infra/aws/us-east-1/dev/eks/cluster` workspace: `default`
<details><summary>Show Output</summary>

```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
╷
│ Warning: Argument is deprecated
│ 
│   with module.eks.aws_eks_addon.this["kube-proxy"],
│   on .terraform/modules/eks/main.tf line 392, in resource "aws_eks_addon" "this":
│  392:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")
│ 
│ The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
│ resource creation. Use "resolve_conflicts_on_create" and/or
│ "resolve_conflicts_on_update" instead
│ 
│ (and 2 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/aws/us-east-1/dev/eks/cluster`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Faws%252Fus-east-1%252Fdev%252Feks%252Fcluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/aws/us-east-1/dev/eks/cluster`
</details>
No changes. Your infrastructure matches the configuration.

---
### 12. dir: `infra/aws/us-east-1/dev/eks/honeycomb` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/eks/honeycomb": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/eks/honeycomb": 
time=2024-01-15T18:47:16Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/eks/cluster] 
time=2024-01-15T18:47:16Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/eks/cluster/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/eks/honeycomb/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:47:16Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 13. dir: `infra/aws/us-east-1/dev/eks/kubevela-addons` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/eks/kubevela-addons": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/eks/kubevela-addons": 
time=2024-01-15T18:47:17Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/eks/cluster] 
time=2024-01-15T18:47:18Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/eks/cluster/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/eks/kubevela-addons/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:47:18Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 14. dir: `infra/aws/us-east-1/dev/rds/security-group` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/rds/security-group": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/rds/security-group": 
time=2024-01-15T18:47:20Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/vpc/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/rds/security-group/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:47:20Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 15. dir: `infra/aws/us-east-1/dev/rds/subnet-group` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/rds/subnet-group": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/rds/subnet-group": 
time=2024-01-15T18:47:21Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/vpc/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-1/dev/rds/subnet-group/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:47:21Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 16. dir: `infra/aws/us-east-1/dev/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 5.0.0"...
- Installing hashicorp/aws v5.32.1...
- Installed hashicorp/aws v5.32.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name" = "scde-dev-us-east-1-us-east-1a"
        }
+       tags_all             = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-us-east-1a"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc                  = (known after apply)
    }

  # aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "scde-dev-us-east-1"
        }
+       tags_all = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id   = (known after apply)
    }

  # aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Name" = "scde-dev-us-east-1-us-east-1a"
        }
+       tags_all                           = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-us-east-1a"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
    }

  # aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # aws_route_table.intra[0] will be created
+   resource "aws_route_table" "intra" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "scde-dev-us-east-1-intra"
        }
+       tags_all         = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-intra"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "scde-dev-us-east-1-private"
        }
+       tags_all         = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-private"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "scde-dev-us-east-1-public"
        }
+       tags_all         = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-public"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table_association.intra[0] will be created
+   resource "aws_route_table_association" "intra" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.intra[1] will be created
+   resource "aws_route_table_association" "intra" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.intra[2] will be created
+   resource "aws_route_table_association" "intra" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[2] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[2] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_subnet.intra[0] will be created
+   resource "aws_subnet" "intra" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.96.0/22"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "scde-dev-us-east-1-intra-us-east-1a"
        }
+       tags_all                                       = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-intra-us-east-1a"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.intra[1] will be created
+   resource "aws_subnet" "intra" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.100.0/22"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "scde-dev-us-east-1-intra-us-east-1b"
        }
+       tags_all                                       = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-intra-us-east-1b"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.intra[2] will be created
+   resource "aws_subnet" "intra" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.104.0/22"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "scde-dev-us-east-1-intra-us-east-1c"
        }
+       tags_all                                       = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1-intra-us-east-1c"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.48.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                     = "scde-dev-us-east-1-private-us-east-1a"
+           "kubernetes.io/cluster/scde-dev-us-east-1" = "shared"
+           "kubernetes.io/role/internal-elb"          = "1"
        }
+       tags_all                                       = {
+           "Environment"                              = "dev"
+           "Name"                                     = "scde-dev-us-east-1-private-us-east-1a"
+           "Organization"                             = "iog"
+           "Project"                                  = "scde"
+           "Terraform"                                = "true"
+           "Tribe"                                    = "smartcontracts"
+           "kubernetes.io/cluster/scde-dev-us-east-1" = "shared"
+           "kubernetes.io/role/internal-elb"          = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.64.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                     = "scde-dev-us-east-1-private-us-east-1b"
+           "kubernetes.io/cluster/scde-dev-us-east-1" = "shared"
+           "kubernetes.io/role/internal-elb"          = "1"
        }
+       tags_all                                       = {
+           "Environment"                              = "dev"
+           "Name"                                     = "scde-dev-us-east-1-private-us-east-1b"
+           "Organization"                             = "iog"
+           "Project"                                  = "scde"
+           "Terraform"                                = "true"
+           "Tribe"                                    = "smartcontracts"
+           "kubernetes.io/cluster/scde-dev-us-east-1" = "shared"
+           "kubernetes.io/role/internal-elb"          = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[2] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.80.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                     = "scde-dev-us-east-1-private-us-east-1c"
+           "kubernetes.io/cluster/scde-dev-us-east-1" = "shared"
+           "kubernetes.io/role/internal-elb"          = "1"
        }
+       tags_all                                       = {
+           "Environment"                              = "dev"
+           "Name"                                     = "scde-dev-us-east-1-private-us-east-1c"
+           "Organization"                             = "iog"
+           "Project"                                  = "scde"
+           "Terraform"                                = "true"
+           "Tribe"                                    = "smartcontracts"
+           "kubernetes.io/cluster/scde-dev-us-east-1" = "shared"
+           "kubernetes.io/role/internal-elb"          = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.0.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                     = "scde-dev-us-east-1-public-us-east-1a"
+           "kubernetes.io/cluster/scde-dev-us-east-1" = "shared"
+           "kubernetes.io/role/elb"                   = "1"
        }
+       tags_all                                       = {
+           "Environment"                              = "dev"
+           "Name"                                     = "scde-dev-us-east-1-public-us-east-1a"
+           "Organization"                             = "iog"
+           "Project"                                  = "scde"
+           "Terraform"                                = "true"
+           "Tribe"                                    = "smartcontracts"
+           "kubernetes.io/cluster/scde-dev-us-east-1" = "shared"
+           "kubernetes.io/role/elb"                   = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.16.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                     = "scde-dev-us-east-1-public-us-east-1b"
+           "kubernetes.io/cluster/scde-dev-us-east-1" = "shared"
+           "kubernetes.io/role/elb"                   = "1"
        }
+       tags_all                                       = {
+           "Environment"                              = "dev"
+           "Name"                                     = "scde-dev-us-east-1-public-us-east-1b"
+           "Organization"                             = "iog"
+           "Project"                                  = "scde"
+           "Terraform"                                = "true"
+           "Tribe"                                    = "smartcontracts"
+           "kubernetes.io/cluster/scde-dev-us-east-1" = "shared"
+           "kubernetes.io/role/elb"                   = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[2] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.50.32.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                     = "scde-dev-us-east-1-public-us-east-1c"
+           "kubernetes.io/cluster/scde-dev-us-east-1" = "shared"
+           "kubernetes.io/role/elb"                   = "1"
        }
+       tags_all                                       = {
+           "Environment"                              = "dev"
+           "Name"                                     = "scde-dev-us-east-1-public-us-east-1c"
+           "Organization"                             = "iog"
+           "Project"                                  = "scde"
+           "Terraform"                                = "true"
+           "Tribe"                                    = "smartcontracts"
+           "kubernetes.io/cluster/scde-dev-us-east-1" = "shared"
+           "kubernetes.io/role/elb"                   = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.50.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name" = "scde-dev-us-east-1"
        }
+       tags_all                             = {
+           "Environment"  = "dev"
+           "Name"         = "scde-dev-us-east-1"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
    }

Plan: 27 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   azs                                         = [
+       "us-east-1a",
+       "us-east-1b",
+       "us-east-1c",
    ]
+   cgw_arns                                    = []
+   cgw_ids                                     = []
+   database_nat_gateway_route_ids              = []
+   database_route_table_association_ids        = []
+   database_route_table_ids                    = [
+       (known after apply),
    ]
+   database_subnet_arns                        = []
+   database_subnets                            = []
+   database_subnets_cidr_blocks                = []
+   database_subnets_ipv6_cidr_blocks           = []
+   default_network_acl_id                      = (known after apply)
+   default_route_table_id                      = (known after apply)
+   default_security_group_id                   = (known after apply)
+   elasticache_route_table_association_ids     = []
+   elasticache_route_table_ids                 = (known after apply)
+   elasticache_subnet_arns                     = []
+   elasticache_subnets                         = []
+   elasticache_subnets_cidr_blocks             = []
+   elasticache_subnets_ipv6_cidr_blocks        = []
+   igw_arn                                     = (known after apply)
+   igw_id                                      = (known after apply)
+   intra_route_table_association_ids           = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   intra_route_table_ids                       = [
+       (known after apply),
    ]
+   intra_subnet_arns                           = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   intra_subnets                               = [
+       (known after apply),
+      
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.